#include <iostream>

using namespace std;

struct Param 
{
    int numPin01 = 0;
    int numPin02 = 0;
    int numDisk  = 0;
};

void HanoiPin(int i, int k, int n);
void InputParam(Param& xParam);
void LoadMenu();
char Menu();
void HanoiGame();
void ListData(Param xParam);

int main() 
{
    setlocale(LC_ALL, "rus");

    LoadMenu();

    while(true)
    {
        switch (Menu())
        {
            case '1':
            {
                HanoiGame();
                break;
            }
            case '0':
            {
                system("cls");
                cout << "\n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n";
                cout << "XX                                                   XX\n";
                cout << "XX                Программа завершена                XX\n";
                cout << "XX                                                   XX\n";
                cout << "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n";
                return 0;
                break;
            }
            default:
            {
                cout << "_________________________________________________\n";
                cout << "|| Вы пытаетесь обмануть программу :(          ||\n";
                cout << "||_____________________________________________||\n\n";
            }
        }
    }
	return 0;
}

void InputParam(Param& xParam)
{
    bool p01 = false;
    bool p02 = false;
    bool p03 = false;

    system("cls");
    cout << "_________________________________________________________________________\n";
    cout << "|| Введите пожалуйста номер башни, на которой распологаются все диски  ||\n";
    cout << "||_____________________________________________________________________||\n\n";
    cout << " > ";
    char aPar01;
    cin >> aPar01;
    cin.ignore(32767, '\n');

    while (p01 == false)
    {
        if ((aPar01 == '1') || (aPar01 == '2') || (aPar01 == '3'))
        {
            if (aPar01 == '1') xParam.numPin01 = 1;
            if (aPar01 == '2')xParam.numPin01 = 2;
            if (aPar01 == '3')xParam.numPin01 = 3;
            p01 = true;
        }
        else
        {
            system("cls");
            cout << "_________________________________________________\n";
            cout << "|| Вы пытаетесь обмануть программу :(          ||\n";
            cout << "||_____________________________________________||\n\n";

            cout << "_________________________________________________________________________\n";
            cout << "|| Введите пожалуйста номер башни, на которой распологаются все диски  ||\n";
            cout << "||_____________________________________________________________________||\n\n";
            cout << " > ";
            cin >> aPar01;
            cin.ignore(32767, '\n');
        }
    }

    system("cls");
    cout << "_________________________________________________________________________________\n";
    cout << "|| Введите пожалуйста номер башни, на которую необходимо переместить все диски ||\n";
    cout << "||_____________________________________________________________________________||\n\n";
    cout << " > ";
    char aPar02;
    cin >> aPar02;
    cin.ignore(32767, '\n');
    while (p02 == false)
    {
        if ((aPar02 == '1') || (aPar02 == '2') || (aPar02 == '3'))
        {
            if (aPar02 == '1') xParam.numPin02 = 1;
            if (aPar02 == '2')xParam.numPin02 = 2;
            if (aPar02 == '3')xParam.numPin02 = 3;
            p02 = true;
        }
        else
        {
            system("cls");
            cout << "_________________________________________________\n";
            cout << "|| Вы пытаетесь обмануть программу :(          ||\n";
            cout << "||_____________________________________________||\n\n";

            cout << "_________________________________________________________________________________\n";
            cout << "|| Введите пожалуйста номер башни, на которую необходимо переместить все диски ||\n";
            cout << "||_____________________________________________________________________________||\n\n";
            cout << " > ";
            cin >> aPar02;
            cin.ignore(32767, '\n');
        }
    }

    system("cls");
    cout << "_________________________________________________________________________\n";
    cout << "|| Введите пожалуйста количество дисков                                ||\n";
    cout << "||_____________________________________________________________________||\n\n";
    cout << " > ";
    cin >> xParam.numDisk;
    cin.ignore(32767, '\n');
    system("cls");
}

void HanoiPin(int i, int k, int n)
{
    if (n == 1) {
        cout << "|| Переместите диск 1 с башни " << i << " на башню " << k << ".\n";
        cout << "||______________________________________________________/\n";
    }
    else {
        int tmp = 6 - i - k; 			// вспомогательная башня (временная)
        HanoiPin(i, tmp, n - 1);
        cout << "|| Переместите диск " << n << " с башни " << i << " на башню " << k << ".\n";
        cout << "||______________________________________________________/\n";
        HanoiPin(tmp, k, n - 1);
    }
}

void LoadMenu()
{
    setlocale(LC_ALL, "rus");
    int n = 0;
    string str = "////////////////////////////////////////////////////////////////////////////////";
    string str_2 = "                                                                                ";
    for (int l = 0; l < 80; l++)
    {
        cout << endl << "\tожидайте конца загрузки\n";
        cout << "\t+--------------------------------------------------------------------------------+\n\t|";
        cout << str.substr(0, l) << str_2.substr(0, 79 - l);
        cout << " |\n\t+--------------------------------------------------------------------------------+\n";
        system("cls");
    }
}

char Menu()
{
    //Меню
    cout << "__________________________________________________________\n";
    cout << "||                    Главное меню                      ||\n";
    cout << "||______________________________________________________||\n";
    cout << "||   Привет, выберите вариант выполнения программы:     ||\n";
    cout << "|| 1 - Игра Ханоиские башни                             ||\n";
    cout << "|| 0 - Завершение программы :(                          ||\n";
    cout << "||______________________________________________________||\n\n";
    cout << "Ваш вариант выполнения программы: ";
    char choice;
    cin >> choice;
    cin.ignore(32767, '\n');
    system("cls");
    return choice;
}

void HanoiGame()
{
    system("cls");
    Param ParamHanoi;
    InputParam(ParamHanoi);
    ListData(ParamHanoi);
    HanoiPin(ParamHanoi.numPin01, ParamHanoi.numPin02, ParamHanoi.numDisk);
    system("pause");
    system("cls");
}

void ListData(Param xParam) 
{
    system("cls");
    cout << "__________________________________________________________\n";
    cout << "||                   Список данных                      ||\n";
    cout << "||______________________________________________________||\n";
    cout << "|| Башная, на которой лежат изначально диски: " << xParam.numPin01 << endl;
    cout << "||______________________________________________________/\n";
    cout << "|| Башная, на которую необходимо переместить диски: " << xParam.numPin02 << endl;
    cout << "||______________________________________________________/\n";
    cout << "|| Количество дисков: " << xParam.numDisk << endl;
    cout << "||______________________________________________________/\n\n";

    cout << "__________________________________________________________\n";
    cout << "||                   Список действий                    ||\n";
    cout << "||______________________________________________________||\n";
}