#include <iostream>
#include <Windows.h>
#include <cstdlib>
#include <math.h>
using namespace std;

int main() {
	
	setlocale(LC_ALL,"Russian");
	srand(unsigned(time(NULL))*100*100*100*100);

	int menufor = 1;

	//Приветствие во вход программы и её запуск
	cout << "__________________________________________________________\n";
	cout << "||          Добро пожаловать в игру - Угадайка          ||\n";
	cout << "||______________________________________________________||\n\n\n";

	cout << "__________________________________________________________\n";
	cout << "||             Ждите программа запускается...           ||\n";
	cout << "||______________________________________________________||\n\n\n";

	Sleep(5000);
	system("cls");

	while (menufor != 0) {
		
		// Объявление данных
		char n,otvet;
		int chislo;
		
		//Меню
		cout << "__________________________________________________________\n";
		cout << "||                    Главное меню                      ||\n";
		cout << "||______________________________________________________||\n";
		cout << "||   Привет, выбери вариант выполнения программы:       ||\n";
		cout << "|| 1 - Начать игру - Угадайка                           ||\n";
		cout << "|| 2 - Завершение программы :(                          ||\n";
		cout << "||______________________________________________________||\n";
		cout << "\n";
		cout << "Ваш вариант выполнения программы: ";
		cin >> n;
		system("cls");

		//Варианты выполнения программы
		switch (n) {

			//Вариант 1 Игра "Угадай число"
		case '1': {
			cout << "____________________________________________________________________\n";
			cout << "|| Введите промежуток значений в котором вы хоитие загадать число ||\n";
			cout << "||________________________________________________________________||\n\n>";
			cin >> chislo;
			system("cls");
			cout << "__________________________________________________________\n";
			cout << "||    Загадайте число из введённого Вами промежутка     ||\n";
			cout << "__________________________________________________________\n\n";
			system("pause");
			system("cls");
			cout << "__________________________________________________________\n";
			cout << "|| Сейчас,Ваш компьютер будт пробовать его угадать,а    ||\n";
			cout << "|| Ваша задача помочь ему - сравнивать выведенное им    ||\n";
			cout << "|| число с Вашим  задуманным и отвечать  компьюетеру    ||\n";
			cout << "|| больше или меньше его число по сравнению с Вашим     ||\n";
			cout << "|| и сказать,ему когда он угадал Ваше число             ||\n";
			cout << "||______________________________________________________||\n\n";
			system("pause");
			system("cls");
			
			//Игра Угадайка
			int otvetfor = 1;
			int randomkom=chislo/2, kolvo = 0, chast = chislo/2;
			while (otvetfor != 2) {
				cout << "  _____________________________________\n";
				cout << " /     Я думаю это число: " << randomkom << "\n";
				cout << "/___________________________________/\n";
				cout << "\n\_______________________________________\n";
				cout << "||      Ваш вариант ответа           ||\n";
				cout << "||___________________________________||\n";
				cout << "|| 1 - Меньше                        ||\n";
				cout << "|| 2 - Больше                        ||\n";
				cout << "|| 3 - Угадал                        ||\n";
				cout << "||___________________________________||\n\n>";
				cin >> otvet;
				system("cls");
				while (otvet > '3' || otvet < '1') {
					cout << "__________________________________________________________\n";
					cout << "||           Вы некорректно ввели ответ!!!              ||\n";
					cout << "||______________________________________________________||\n\n\n";
					cout << "  _____________________________________\n";
					cout << " /     Я думаю это число: " << randomkom << "\n";
					cout << "/___________________________________/\n";
					cout << "_______________________________________\n";
					cout << "||      Ваш вариант ответа           ||\n";
					cout << "||___________________________________||\n";
					cout << "|| 1 - Меньше                        ||\n";
					cout << "|| 2 - Больше                        ||\n";
					cout << "|| 3 - Угадал                        ||\n";
					cout << "||___________________________________||\n\n>";
					cin >> otvet;
					system("cls");
				}
				//Вычисление число путём бинароного отбора
				kolvo = kolvo + 1;
				if (otvet == '1') {
					if (kolvo == 1) {
						randomkom = chast - chast / 2;
						chast = chast / 2;
					}
					else {
						randomkom = randomkom - chast;
					}
					if (chast == 0) {
						randomkom = randomkom - 1;
					}
				}
				if (otvet == '2') {
					if ( kolvo == 1){
						randomkom = chast + chast / 2;
						chast = chast / 2;
					}
					else {
						randomkom = randomkom + chast;
					}
					if (chast == 0) {
						randomkom = randomkom + 1;
					}
				}
				if (otvet == '3') {
					otvetfor = 2;
				}
				chast = chast / 2;
			}
			system("cls");
			//Максимальное количество шагов бинарного поиска
			int max_shag = 0,gread = chislo;
			while (gread !=0 ) {
				gread = gread / 2;
				max_shag = max_shag + 1;
			}
			//Вывод задуманного Вами числа и количество попыток компьютера
			cout << "__________________________________________________________\n";
			cout << "||                    Результаты                        ||\n";
			cout << "||______________________________________________________||\n";\
			cout << "----------------------------------------------------------\n";
			cout << " Вы задумали число " << randomkom << "\n";
			cout << "----------------------------------------------------------\n";
			cout << " Программе понадобилось "<< kolvo <<" попыток \n";
			cout << "----------------------------------------------------------\n";
			cout << " Максимальное количество шагов бинарного поиска =  " << max_shag << "\n";
			cout << "----------------------------------------------------------\n\n\n";
			//Конец игры Угадайка
			system("pause");
			system("cls");
			break;
		}

			//Вариант 2 Выход из программы
		case '2': {
			system("cls");
			cout << "\n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n";
			cout << "XX                                                   XX\n";
			cout << "XX                Программа завершена                XX\n";
			cout << "XX                                                   XX\n";
			cout << "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n";
			return 0;
			break;
		}

			//Невернай вариант выполнения 
		default: {
			cout << "_______________________________________________________\n";
			cout << "Вы ввели некорректный вариант выполнения\t!!!!!!!\n";
			cout << "программы,и были возвращены в меню\t\t!!!!!!!\n";
			cout << "_______________________________________________________\n\n\n";
			break;
		}
		}
	}

	return 0;
}